{
  "name": "text-demo",
  "type": "registry:example",
  "files": [
    {
      "path": "examples/text-demo.tsx",
      "content": "import { Text } from \"@/registry/default/ui/text\"\n\nexport default function TextDemo() {\n  return (\n    <div>\n      <Text variant=\"h1\">The Joke Tax Chronicles</Text>\n      <Text variant=\"p\">\n        Once upon a time, in a far-off land, there was a very lazy king who\n        spent all day lounging on his throne. One day, his advisors came to him\n        with a problem: the kingdom was running out of money.\n      </Text>\n      <Text variant=\"h2\">The King's Plan</Text>\n      <Text>\n        The king thought long and hard, and finally came up with{\" \"}\n        <Text href=\"#\" variant=\"a\">\n          a brilliant plan\n        </Text>\n        : he would tax the jokes in the kingdom.\n      </Text>\n      <Text variant=\"blockquote\">\n        \"After all,\" he said, \"everyone enjoys a good joke, so it's only fair\n        that they should pay for the privilege.\"\n      </Text>\n      <Text variant=\"h3\">The Joke Tax</Text>\n      <Text>\n        The king's subjects were not amused. They grumbled and complained, but\n        the king was firm:\n      </Text>\n      <Text variant=\"ul\">\n        <li>1st level of puns: 5 gold coins</li>\n        <li>2nd level of jokes: 10 gold coins</li>\n        <li>3rd level of one-liners : 20 gold coins</li>\n      </Text>\n      <Text>\n        As a result, people stopped telling jokes, and the kingdom fell into a\n        gloom. But there was one person who refused to let the king's\n        foolishness get him down: a court jester named Jokester.\n      </Text>\n      <Text variant=\"h3\">Jokester's Revolt</Text>\n      <Text>\n        Jokester began sneaking into the castle in the middle of the night and\n        leaving jokes all over the place: under the king's pillow, in his soup,\n        even in the royal toilet. The king was furious, but he couldn't seem to\n        stop Jokester.\n      </Text>\n      <Text>\n        And then, one day, the people of the kingdom discovered that the jokes\n        left by Jokester were so funny that they couldn't help but laugh. And\n        once they started laughing, they couldn't stop.\n      </Text>\n      <Text variant=\"h3\">The People's Rebellion</Text>\n      <Text>\n        The people of the kingdom, feeling uplifted by the laughter, started to\n        tell jokes and puns again, and soon the entire kingdom was in on the\n        joke.\n      </Text>\n      <Text>\n        The king, seeing how much happier his subjects were, realized the error\n        of his ways and repealed the joke tax. Jokester was declared a hero, and\n        the kingdom lived happily ever after.\n      </Text>\n      <Text>\n        The moral of the story is: never underestimate the power of a good laugh\n        and always be careful of bad ideas.\n      </Text>\n    </div>\n  )\n}\n",
      "type": "registry:example",
      "target": ""
    }
  ]
}